{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_input"}, "name": "encoder_input", "inbound_nodes": []}, {"class_name": "PConv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1", "inbound_nodes": [[["input_1", 0, 0, {}], ["encoder_input", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu", "op": "Relu", "input": ["conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2", "inbound_nodes": [[["tf_op_layer_Relu", 0, 0, {}], ["conv1", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_1", "op": "Relu", "input": ["conv2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_1", "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3", "inbound_nodes": [[["tf_op_layer_Relu_1", 0, 0, {}], ["conv2", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_2", "op": "Relu", "input": ["conv3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_2", "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv4", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4", "inbound_nodes": [[["tf_op_layer_Relu_2", 0, 0, {}], ["conv3", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_3", "op": "Relu", "input": ["conv4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_3", "inbound_nodes": [[["conv4", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv5", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv5", "inbound_nodes": [[["tf_op_layer_Relu_3", 0, 0, {}], ["conv4", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_4", "op": "Relu", "input": ["conv5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_4", "inbound_nodes": [[["conv5", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv6", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv6", "inbound_nodes": [[["tf_op_layer_Relu_4", 0, 0, {}], ["conv5", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_5", "op": "Relu", "input": ["conv6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_5", "inbound_nodes": [[["conv6", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv7", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv7", "inbound_nodes": [[["tf_op_layer_Relu_5", 0, 0, {}], ["conv6", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_6", "op": "Relu", "input": ["conv7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_6", "inbound_nodes": [[["conv7", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "encoder_output", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "encoder_output", "inbound_nodes": [[["tf_op_layer_Relu_6", 0, 0, {}], ["conv7", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_7", "op": "Relu", "input": ["encoder_output/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_7", "inbound_nodes": [[["encoder_output", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d", "inbound_nodes": [[["tf_op_layer_Relu_7", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_1", "inbound_nodes": [[["encoder_output", 0, 1, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate", "inbound_nodes": [[["tf_op_layer_Relu_6", 0, 0, {}], ["up_sampling2d", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_1", "inbound_nodes": [[["conv7", 0, 1, {}], ["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv9", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv9", "inbound_nodes": [[["concatenate", 0, 0, {}], ["concatenate_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_8", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_8", "op": "Relu", "input": ["conv9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_8", "inbound_nodes": [[["conv9", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv10", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv10", "inbound_nodes": [[["tf_op_layer_Relu_8", 0, 0, {}], ["conv9", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_9", "op": "Relu", "input": ["conv10/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_9", "inbound_nodes": [[["conv10", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_2", "inbound_nodes": [[["tf_op_layer_Relu_9", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_3", "inbound_nodes": [[["conv10", 0, 1, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_2", "inbound_nodes": [[["tf_op_layer_Relu_4", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_3", "inbound_nodes": [[["conv5", 0, 1, {}], ["up_sampling2d_3", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv11", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv11", "inbound_nodes": [[["concatenate_2", 0, 0, {}], ["concatenate_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_10", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_10", "op": "Relu", "input": ["conv11/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_10", "inbound_nodes": [[["conv11", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv12", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv12", "inbound_nodes": [[["tf_op_layer_Relu_10", 0, 0, {}], ["conv11", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_11", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_11", "op": "Relu", "input": ["conv12/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_11", "inbound_nodes": [[["conv12", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_4", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_4", "inbound_nodes": [[["tf_op_layer_Relu_11", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_5", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_5", "inbound_nodes": [[["conv12", 0, 1, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_4", "inbound_nodes": [[["tf_op_layer_Relu_2", 0, 0, {}], ["up_sampling2d_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_5", "inbound_nodes": [[["conv3", 0, 1, {}], ["up_sampling2d_5", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv13", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv13", "inbound_nodes": [[["concatenate_4", 0, 0, {}], ["concatenate_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_12", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_12", "op": "Relu", "input": ["conv13/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_12", "inbound_nodes": [[["conv13", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv14", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv14", "inbound_nodes": [[["tf_op_layer_Relu_12", 0, 0, {}], ["conv13", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_13", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_13", "op": "Relu", "input": ["conv14/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_13", "inbound_nodes": [[["conv14", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_6", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_6", "inbound_nodes": [[["tf_op_layer_Relu_13", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_7", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_7", "inbound_nodes": [[["conv14", 0, 1, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_6", "inbound_nodes": [[["tf_op_layer_Relu", 0, 0, {}], ["up_sampling2d_6", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_7", "inbound_nodes": [[["conv1", 0, 1, {}], ["up_sampling2d_7", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "conv15", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv15", "inbound_nodes": [[["concatenate_6", 0, 0, {}], ["concatenate_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_14", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_14", "op": "Relu", "input": ["conv15/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_14", "inbound_nodes": [[["conv15", 0, 0, {}]]]}, {"class_name": "PConv2D", "config": {"name": "decoder_output", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "decoder_output", "inbound_nodes": [[["tf_op_layer_Relu_14", 0, 0, {}], ["conv15", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Relu_15", "trainable": true, "dtype": "float32", "node_def": {"name": "Relu_15", "op": "Relu", "input": ["decoder_output/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Relu_15", "inbound_nodes": [[["decoder_output", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["tf_op_layer_Relu_15", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["encoder_input", 0, 0]], "output_layers": [["conv2d", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv1/img_kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv1/Variable", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv10/img_kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv10/Variable", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv10/bias", "shape": [128], "dtype": "float32"}, {"name": "conv11/img_kernel", "shape": [3, 3, 160, 128], "dtype": "float32"}, {"name": "conv11/Variable", "shape": [3, 3, 160, 128], "dtype": "float32"}, {"name": "conv11/bias", "shape": [128], "dtype": "float32"}, {"name": "conv12/img_kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv12/Variable", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv12/bias", "shape": [64], "dtype": "float32"}, {"name": "conv13/img_kernel", "shape": [3, 3, 96, 64], "dtype": "float32"}, {"name": "conv13/Variable", "shape": [3, 3, 96, 64], "dtype": "float32"}, {"name": "conv13/bias", "shape": [64], "dtype": "float32"}, {"name": "conv14/img_kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv14/Variable", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv14/bias", "shape": [32], "dtype": "float32"}, {"name": "conv15/img_kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv15/Variable", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv15/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2/img_kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2/Variable", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d/kernel", "shape": [3, 3, 3, 3], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [3], "dtype": "float32"}, {"name": "conv3/img_kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv3/Variable", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv3/bias", "shape": [32], "dtype": "float32"}, {"name": "conv4/img_kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv4/Variable", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv4/bias", "shape": [32], "dtype": "float32"}, {"name": "conv5/img_kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv5/Variable", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv5/bias", "shape": [32], "dtype": "float32"}, {"name": "conv6/img_kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv6/Variable", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv6/bias", "shape": [32], "dtype": "float32"}, {"name": "conv7/img_kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv7/Variable", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv7/bias", "shape": [32], "dtype": "float32"}, {"name": "conv9/img_kernel", "shape": [3, 3, 64, 256], "dtype": "float32"}, {"name": "conv9/Variable", "shape": [3, 3, 64, 256], "dtype": "float32"}, {"name": "conv9/bias", "shape": [256], "dtype": "float32"}, {"name": "decoder_output/img_kernel", "shape": [3, 3, 32, 3], "dtype": "float32"}, {"name": "decoder_output/Variable", "shape": [3, 3, 32, 3], "dtype": "float32"}, {"name": "decoder_output/bias", "shape": [3], "dtype": "float32"}, {"name": "encoder_output/img_kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "encoder_output/Variable", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "encoder_output/bias", "shape": [32], "dtype": "float32"}]}]}